<?php

///////////////////////////////////////////////////////////
$sad_kaomojis = [
    '(ノ_<。)',
    '(*-_-)',
    '(´-ω-`)',
    '.･ﾟﾟ･(／ω＼)･ﾟﾟ･.',
    '(μ_μ)',
    '(ﾉД`)',
    '(-ω-、)',
    '。゜゜(´Ｏ`) ゜゜。',
    'o(TヘTo)',
    '( ; ω ; )',
    '(｡╯3╰｡)',
    '｡･ﾟﾟ*(>д<)*ﾟﾟ･｡',
    '( ﾟ，_ゝ｀)',
    '(个_个)',
    '(╯︵╰,)',
    '｡･ﾟ(ﾟ><ﾟ)ﾟ･｡',
    '( ╥ω╥ )',
    '(╯_╰)',
    '(╥_╥)',
    '.｡･ﾟﾟ･(＞_＜)･ﾟﾟ･｡.',
    '(／ˍ・、)',
    '(ノ_<、)',
    '(╥﹏╥)',
    '｡ﾟ(｡ﾉωヽ｡)ﾟ｡',
    '(つω`*)',
    '(｡T ω T｡)',
    '(ﾉω･､)',
    '･ﾟ･(｡>ω<｡)･ﾟ･',
    '(T_T)',
    '(>_<)',
    '(Ｔ▽Ｔ)',
    '｡ﾟ･ (>﹏<) ･ﾟ｡',
    'o(〒﹏〒)o',
    '(｡•́︿•̀｡)',
    '(ಥ﹏ಥ)',
];

$happy_kaomojis = [
    '(* ^ ω ^)',
    '(´ ∀ ` *)',
    '٩(◕‿◕｡)۶',
    '☆*:.｡.o(≧▽≦)o.｡.:*☆',
    '(o^▽^o)',
    '(⌒▽⌒)☆',
    '<(￣︶￣)>',
    'ヽ(・∀・)ﾉ',
    '(´｡• ω •｡`)',
    '(￣ω￣)',
    '｀;:゛;｀;･(°ε° )',
    '(o･ω･o)',
    '(＠＾－＾)',
    'ヽ(*・ω・)ﾉ',
    '(o_ _)ﾉ彡☆',
    '(^人^)',
    '(o´▽`o)',
    '(*´▽`*)',
    '｡ﾟ( ﾟ^∀^ﾟ)ﾟ｡',
    '( ´ ω ` )',
    '(((o(*°▽°*)o)))',
    '(≧◡≦)',
    '(o´∀`o)',
    '(´• ω •`)',
    '(＾▽＾)',
    '(⌒ω⌒)',
    '∑d(°∀°d)',
    '╰(▔∀▔)╯',
    '(─‿‿─)',
    '(*^‿^*)',
    'ヽ(o^―^o)ﾉ',
    '(✯◡✯)',
    '(◕‿◕)',
    '(*≧ω≦*)',
    '(☆▽☆)',
    '(⌒‿⌒)',
    '＼(≧▽≦)／',
    '⌒(o＾▽＾o)ノ',
    '(*°▽°*)',
    '٩(｡•́‿•̀｡)۶',
    '(✧ω✧)',
    'ヽ(*⌒▽⌒*)ﾉ',
    '(´｡• ᵕ •｡`)',
    '( ´ ▽ ` )',
    '(￣▽￣)',
    '╰(*´︶`*)╯',
    'ヽ(>∀<☆)ノ',
    'o(≧▽≦)o',
    '(☆ω☆)',
    '(っ˘ω˘ς )',
    '＼(￣▽￣)／',
    '(*¯︶¯*)',
    '＼(＾▽＾)／',
    '٩(◕‿◕)۶',
    '(o˘◡˘o)',
    '\(★ω★)/',
    '\(^ヮ^)/',
    '(〃＾▽＾〃)',
    '(╯✧▽✧)╯',
    'o(>ω<)o',
    'o( ❛ᴗ❛ )o',
    '｡ﾟ(TヮT)ﾟ｡',
    '( ‾́ ◡ ‾́ )',
    '(ﾉ´ヮ`)ﾉ*: ･ﾟ',
];

$angry_kaomojis = [
    '(＃`Д´)',
    '(`皿´＃)',
    '( ` ω ´ )',
    'ヽ( `д´*)ノ',
    '(・`ω´・)',
    '(`ー´)',
    'ヽ(`⌒´メ)ノ',
    '凸(`△´＃)',
    '( `ε´ )',
    'ψ( ` ∇ ´ )ψ',
    'ヾ(`ヘ´)ﾉﾞ',
    'ヽ(‵﹏´)ノ',
    '(ﾒ` ﾛ ´)',
    '(╬`益´)',
    '┌∩┐(◣_◢)┌∩┐',
    '凸( ` ﾛ ´ )凸',
    'Σ(▼□▼メ)',
    '(°ㅂ°╬)',
    'ψ(▼へ▼メ)～→',
    '(ノ°益°)ノ',
    '(҂ `з´ )',
    '(‡▼益▼)',
    '(҂` ﾛ ´)凸',
    '((╬◣﹏◢))',
    '٩(╬ʘ益ʘ╬)۶',
    '(╬ Ò﹏Ó)',
    '＼＼٩(๑`^´๑)۶／／',
    '(凸ಠ益ಠ)凸',
    '↑_(ΦwΦ)Ψ',
    '←~(Ψ▼ｰ▼)∈',
    '୧((#Φ益Φ#))୨',
    '٩(ఠ益ఠ)۶',
    '(ﾉಥ益ಥ)ﾉ',
];

$confused_kaomojis = [
    '(￣ω￣;)',
    'σ(￣、￣〃)',
    '(￣～￣;)',
    '(-_-;)・・・',
    '(・_・ヾ',
    '(〃￣ω￣〃ゞ',
    '┐(￣ヘ￣;)┌',
    '(・_・;)',
    '(￣_￣)・・・',
    '╮(￣ω￣;)╭',
    '(￣.￣;)',
    '(＠_＠)',
    '(・・;)ゞ',
    'Σ(￣。￣ﾉ)',
    '(・・ ) ?',
    '(•ิ_•ิ)?',
    '(◎ ◎)ゞ',
    '(ーー;)',
    'ლ(ಠ_ಠ ლ)',
    'ლ(¯ロ¯"ლ)',
];

$surprised_kaomojis = [
    'w(°ｏ°)w',
    'ヽ(°〇°)ﾉ',
    'Σ(O_O)',
    'Σ(°ロ°)',
    '(⊙_⊙)',
    '(o_O)',
    '(O_O;)',
    '(O.O)',
    '(°ロ°) !',
    '(o_O) !',
    '(□_□)',
    'Σ(□_□)',
    '∑(O_O;)',
    '( : ౦ ‸ ౦ : )',
];

$embarrassed_kaomojis = [
    '(⌒_⌒;)',
    '(o^ ^o)',
    '(*/ω＼)',
    '(*/。＼)',
    '(*/_＼)',
    '(*ﾉωﾉ)',
    '(o-_-o)',
    '(*μ_μ)',
    '( ◡‿◡ *)',
    '(ᵔ.ᵔ)',
    '(//ω//)',
    '(ノ*°▽°*)',
    '(*^.^*)',
    '(*ﾉ▽ﾉ)',
    '(￣▽￣*)ゞ',
    '(⁄ ⁄•⁄ω⁄•⁄ ⁄)',
    '(*/▽＼*)',
    '(⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄)',
];


$kaomojis = array_merge($sad_kaomojis, $happy_kaomojis, $angry_kaomojis, $confused_kaomojis, $surprised_kaomojis, $embarrassed_kaomojis);



$lennyception = "( (   ͡° ͜ʖ ͡° )
 (   (   ͡° ͜ʖ ͡° )
 (   ͡° (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° ) (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͡° )
 (   ͡° ͜ʖ ͡° )° )
 (   ͡° ͜ʖ ͡° )
 ( (   ͡° ͜ʖ ͡° )
 (   (   ͡° ͜ʖ ͡° )
 (   ͡° (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° ) (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͡° )
 (   ͡° ͜ʖ ͡° )° )
 (   ͡° ͜ʖ ͡° ))
 (   ͡° ͜ʖ ͡° )
 ( (   ͡° ͜ʖ ͡° )
 (   (   ͡° ͜ʖ ͡° )
 (   ͡° (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° ) (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͡° )
 (   ͡° ͜ʖ ͡° )° )
 (   ͡° ͜ʖ ͡° )
 ( (   ͡° ͜ʖ ͡° )
 (   (   ͡° ͜ʖ ͡° )
 (   ͡° (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° ) (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͡° )
 (   ͡° ͜ʖ ͡° )° )
 (   ͡° ͜ʖ ͡° ))
 (   ͡° ͜ʖ ͡° )
 ( (   ͡° ͜ʖ ͡° )
 (   (   ͡° ͜ʖ ͡° )
 (   ͡° (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° ) (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͡° )
 (   ͡° ͜ʖ ͡° )° )
 (   ͡° ͜ʖ ͡° )
 ( (   ͡° ͜ʖ ͡° )
 (   (   ͡° ͜ʖ ͡° )
 (   ͡° (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ (   ͡° ͜ʖ ͡° )
(   ͡° ͜ʖ ͡° (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° ) (   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )(   ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͡° ͜ʖ ͡° )
 (   ͡° ͜ʖ ͡° )  ͜ʖ ͡° )";


$fortunes = [
    "It is certain",
    "It is decidedly so",
    "Without a doubt",
    "Yes definitely",
    "You may rely on it",
    "As I see it, yes",
    "Most likely",
    "Outlook good",
    "Yes",
    "Signs point to yes",
    "Reply hazy try again",
    "Ask again later",
    "Better not tell you now",
    "Cannot predict now",
    "Concentrate and ask again",
    "Don't count on it",
    "My reply is no",
    "My sources say no",
    "Outlook not so good",
    "Very doubtful",
];
